PRAK701/app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'akuadmin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();