PRAK701/app/Controllers/Buku.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu untuk mengakses halaman buku.');
        }
        $data = [
            'title' => 'Daftar Buku',
            'buku'  => $this->bukuModel->findAll(),
---
SELECT *
FROM `buku`

            return redirect()->back()->withInput()->with('validation', \Config\Services::validation());
        }

        $this->bukuModel->save([
            'judul'        => $this->request->getPost('judul'),
            'penulis'      => $this->request->getPost('penulis'),
            'penerbit'     => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Buah Semangka', 'Cal Newport', 'tapa musyada', '1902')

    public function delete($id)
    {
        $this->bukuModel->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('2')

    public function edit($id)
    {
        $buku = $this->bukuModel->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '2'

            return redirect()->back()->withInput()->with('validation', \Config\Services::validation());
        }

        $this->bukuModel->save([
            'id'           => $id,
            'judul'        => $this->request->getPost('judul'),
            'penulis'      => $this->request->getPost('penulis'),
            'penerbit'     => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
UPDATE `buku` SET `judul` = 'Seorang wanita yang ingin menjadi pohon semangka di kehidupan berikutnya', `penulis` = 'Cal Newport', `penerbit` = 'Gramed', `tahun_terbit` = '1902'
WHERE `buku`.`id` IN ('2')